In [35]:
import numpy as np
import pandas as pd

import random

In [58]:
[random.randint(0,50) for j in range(10)]

[33, 18, 43, 9, 12, 4, 19, 8, 7, 1]

In [97]:
data_dict = {f'column {i}': [random.randint(0,50) for j in range(10)] for i in range(10)}

data_df = pd.DataFrame(data_dict)

data_df

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,22,3,25,7,25,29,46,49,1,39
1,41,19,2,43,17,46,20,12,34,31
2,48,24,26,48,9,13,23,40,45,41
3,47,8,45,8,26,20,37,5,49,17
4,20,29,3,10,7,31,18,30,10,29
5,19,27,34,20,50,36,13,48,25,3
6,13,16,33,46,10,19,35,27,39,16
7,1,19,27,3,38,29,49,8,20,46
8,30,24,32,44,17,4,46,14,31,5
9,46,11,50,33,32,49,8,8,31,8

How to change specific values of a dataframe

iloc

In [86]:
data_df.iloc[2, 3] = -100

loc

In [92]:
data_df.loc[4, 'column 6'] = 'spooky'

C:\Users\Leyla\AppData\Local\Temp\ipykernel_152976\1601888755.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'spooky' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  data_df.loc[4, 'column 6'] = 'spooky'

In [93]:
data_df

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,46.0,10.0,27.0,29.0,31.0,31.0,44,3.0,30,17.0
1,16.0,3.0,48.0,15.0,31.0,NaN,32,45.0,8,47.0
2,16.0,30.0,28.0,-100.0,5.0,43.0,33,NaN,30,16.0
3,19.0,NaN,NaN,49.0,25.0,24.0,4,NaN,23,44.0
4,NaN,5.0,NaN,39.0,16.0,26.0,spooky,42.0,44,22.0
5,47.0,46.0,5.0,37.0,NaN,7.0,2,12.0,0,NaN
6,41.0,4.0,17.0,30.0,30.0,16.0,33,25.0,20,41.0
7,44.0,16.0,48.0,46.0,41.0,36.0,15,15.0,46,24.0
8,4.0,31.0,10.0,37.0,16.0,37.0,4,33.0,33,7.0
9,50.0,19.0,49.0,NaN,39.0,4.0,43,4.0,7,10.0

In [94]:
data_df.loc[2, 'column 6'] = None

In [95]:
data_df

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,46.0,10.0,27.0,29.0,31.0,31.0,44,3.0,30,17.0
1,16.0,3.0,48.0,15.0,31.0,NaN,32,45.0,8,47.0
2,16.0,30.0,28.0,-100.0,5.0,43.0,None,NaN,30,16.0
3,19.0,NaN,NaN,49.0,25.0,24.0,4,NaN,23,44.0
4,NaN,5.0,NaN,39.0,16.0,26.0,spooky,42.0,44,22.0
5,47.0,46.0,5.0,37.0,NaN,7.0,2,12.0,0,NaN
6,41.0,4.0,17.0,30.0,30.0,16.0,33,25.0,20,41.0
7,44.0,16.0,48.0,46.0,41.0,36.0,15,15.0,46,24.0
8,4.0,31.0,10.0,37.0,16.0,37.0,4,33.0,33,7.0
9,50.0,19.0,49.0,NaN,39.0,4.0,43,4.0,7,10.0

In [96]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   column 0  9 non-null      float64
 1   column 1  9 non-null      float64
 2   column 2  8 non-null      float64
 3   column 3  9 non-null      float64
 4   column 4  9 non-null      float64
 5   column 5  9 non-null      float64
 6   column 6  9 non-null      object
 7   column 7  8 non-null      float64
 8   column 8  10 non-null     int64
 9   column 9  9 non-null      float64
dtypes: float64(8), int64(1), object(1)
memory usage: 932.0+ bytes

In [80]:
[type(element) for element in data_df['column 6']]

[int, int, int, int, str, int, int, int, int, int]

- None - Pythonic missing data. A Python object - operations done on Python level and not numpy or pandas.
    - Error when performing arithmetic on None dtypes
- NaN - floating point "Not a Number". Supports fast operations, however all arithmetic operations with NaN results in a NaN
- NA - pd.NA -> missing indicator that can be used consistently across data types

**Insert Nones into our DataFrame**

In [98]:
for i in range(10):

    row = random.randint(0,9)
    column = random.randint(0,9)

    print(f'overwritting [{row}, {column}]')

    data_df.loc[row, f'column {column}'] = None

overwritting [8, 2]
overwritting [0, 3]
overwritting [1, 9]
overwritting [7, 9]
overwritting [3, 5]
overwritting [9, 9]
overwritting [1, 8]
overwritting [4, 7]
overwritting [8, 1]
overwritting [3, 0]

In [99]:
data_df

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,22.0,3.0,25.0,NaN,25,29.0,46,49.0,1.0,39.0
1,41.0,19.0,2.0,43.0,17,46.0,20,12.0,NaN,NaN
2,48.0,24.0,26.0,48.0,9,13.0,23,40.0,45.0,41.0
3,NaN,8.0,45.0,8.0,26,NaN,37,5.0,49.0,17.0
4,20.0,29.0,3.0,10.0,7,31.0,18,NaN,10.0,29.0
5,19.0,27.0,34.0,20.0,50,36.0,13,48.0,25.0,3.0
6,13.0,16.0,33.0,46.0,10,19.0,35,27.0,39.0,16.0
7,1.0,19.0,27.0,3.0,38,29.0,49,8.0,20.0,NaN
8,30.0,NaN,NaN,44.0,17,4.0,46,14.0,31.0,5.0
9,46.0,11.0,50.0,33.0,32,49.0,8,8.0,31.0,NaN

Pandas treats NaN and None almost interchangeably
- isnull() - returns true if value is null  
- notnull() - returns true if value is not null
- dropna() - drops the the whole axis with nulls 
- fillna() - fills the null values with certain value

In [102]:
data_df.isnull()

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,False,False,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,True,True
2,False,False,False,False,False,False,False,False,False,False
3,True,False,False,False,False,True,False,False,False,False
4,False,False,False,False,False,False,False,True,False,False
5,False,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False,False,True
8,False,True,True,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False,True

In [103]:
data_df.notnull()

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,True,True,True,False,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,False,False
2,True,True,True,True,True,True,True,True,True,True
3,False,True,True,True,True,False,True,True,True,True
4,True,True,True,True,True,True,True,False,True,True
5,True,True,True,True,True,True,True,True,True,True
6,True,True,True,True,True,True,True,True,True,True
7,True,True,True,True,True,True,True,True,True,False
8,True,False,False,True,True,True,True,True,True,True
9,True,True,True,True,True,True,True,True,True,False

In [108]:
# drop all rows with atleast 1 missing value
data_df.dropna(axis=0)

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
2,48.0,24.0,26.0,48.0,9,13.0,23,40.0,45.0,41.0
5,19.0,27.0,34.0,20.0,50,36.0,13,48.0,25.0,3.0
6,13.0,16.0,33.0,46.0,10,19.0,35,27.0,39.0,16.0

In [109]:
# drop all columns with atleast 1 missing value
data_df.dropna(axis=1)

   column 4  column 6
0        25        46
1        17        20
2         9        23
3        26        37
4         7        18
5        50        13
6        10        35
7        38        49
8        17        46
9        32         8

Vi kan fylla alla missing values med ett angivet värde

In [117]:
data_df.fillna(-999)

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,22.0,3.0,25.0,-999.0,25,29.0,46,49.0,1.0,39.0
1,41.0,19.0,2.0,43.0,17,46.0,20,12.0,-999.0,-999.0
2,48.0,24.0,26.0,48.0,9,13.0,23,40.0,45.0,41.0
3,-999.0,8.0,45.0,8.0,26,-999.0,37,5.0,49.0,17.0
4,20.0,29.0,3.0,10.0,7,31.0,18,-999.0,10.0,29.0
5,19.0,27.0,34.0,20.0,50,36.0,13,48.0,25.0,3.0
6,13.0,16.0,33.0,46.0,10,19.0,35,27.0,39.0,16.0
7,1.0,19.0,27.0,3.0,38,29.0,49,8.0,20.0,-999.0
8,30.0,-999.0,-999.0,44.0,17,4.0,46,14.0,31.0,5.0
9,46.0,11.0,50.0,33.0,32,49.0,8,8.0,31.0,-999.0

isnull() och notnull() funkar även för Series

In [129]:
data_df[data_df['column 0'] > 20]

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
0,22.0,3.0,25.0,NaN,25,29.0,46,49.0,1.0,39.0
1,41.0,19.0,2.0,43.0,17,46.0,20,12.0,NaN,NaN
2,48.0,24.0,26.0,48.0,9,13.0,23,40.0,45.0,41.0
8,30.0,NaN,NaN,44.0,17,4.0,46,14.0,31.0,5.0
9,46.0,11.0,50.0,33.0,32,49.0,8,8.0,31.0,NaN

In [125]:
mitt_filter = data_df['column 0'].isnull()

mitt_filter

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: column 0, dtype: bool

In [126]:
data_df[mitt_filter]

,column 0,column 1,column 2,column 3,column 4,column 5,column 6,column 7,column 8,column 9
3,NaN,8.0,45.0,8.0,26,NaN,37,5.0,49.0,17.0